INSERT INTO "Gathering"
("id", "userId", "title", "description", "location", "participantNumbers", "price", "status", "type", "startTime", "dueDate", "isArchived", "createdAt", "updatedAt") VALUES
(1, 10, '手作體驗', '聚集志同道合的人，共度特別時光的手作體驗。', '霧森縣翠柏市林語街 4 巷 28 號', 60, 200, 'CLOSED', 'OTHER', '2024-05-16 22:00:00', '2024-05-14 22:00:00', FALSE, '2024-04-19 22:00:00', '2024-04-19 22:00:00'),
(2, 12, 'AI 開發者社群聚會', '提供最新知識與技能交流，這是一場AI 開發者社群聚會。', '晨光縣朝陽市朝日路 260 號', 30, 200, 'CLOSED', 'LEARNING', '2024-05-23 10:00:00', '2024-05-19 10:00:00', FALSE, '2024-05-06 10:00:00', '2024-05-06 10:00:00'),
(3, 2, '攝影展揪一波', '主揪可能只會拍人，不一定在看展，想來亂晃的可以+1。', '星辰縣銀河市流星大道 88 號', 30, 700, 'CLOSED', 'EXHIBITION', '2025-03-15 10:00:00', '2025-03-11 00:00:00', FALSE, '2025-01-05 14:30:00', '2025-01-05 14:30:00'),
(4, 4, '啤酒節生死鬥', '去年被灌到回不了家，今年打算吃東西為主，誰要來幫顧戰力。', '彩虹縣晴夢市繽紛街 12 巷 6 號', 30, 0, 'CLOSED', 'FOOD', '2025-01-22 12:00:00', '2025-01-19 12:00:00', FALSE, '2025-01-09 12:00:00', '2025-01-09 12:00:00'),
(5, 5, '花蓮旅遊但會累爆', '有點後悔自己排這麼滿的行程，但錢都繳了只能硬著頭皮揪人了。', '幻月縣霜影市月華路 377 號', 50, 5400, 'CLOSED', 'TRAVEL', '2025-02-11 11:00:00', '2025-02-08 11:00:00', FALSE, '2025-01-19 11:00:00', '2025-01-19 11:00:00'),
(6, 6, '部門耶誕交換禮物', '我們部門自己辦的，可以帶朋友來！但先說活動很吵XD', '青風縣翡翠市清泉街 5 巷 19 號', 30, 300, 'CLOSED', 'PARTY', '2025-03-12 16:00:00', '2025-03-09 16:00:00', FALSE, '2025-02-16 16:00:00', '2025-02-16 16:00:00'),
(7, 2, '要不要來學AI', '很怕報名的人都跑了所以先說：前面會有吃的，然後才是講座。一起坐一起滑手機也可以。', '幸福縣快樂市陽光路 220 號', 15, 100, 'CLOSED', 'LEARNING', '2025-04-24 11:00:00', '2025-04-14 11:00:00', FALSE, '2025-03-01 11:00:00', '2025-03-01 11:00:00'),
(8, 2, '吃吃找找行軍賽', '這不是什麼正經活動，單純揪大家一起吃+迷路，怕吵勿報。', '琉璃縣光海市瑠光路 102 號', 30, 200, 'CLOSED', 'FOOD', '2025-04-09 17:00:00', '2025-03-26 17:00:00', FALSE, '2025-03-06 17:00:00', '2025-03-06 17:00:00'),
(9, 2, '學習營但中間有在偷玩', '中間會有偷懶時段可以聊天，要認真學的人也歡迎，但我可能會滑手機。', '雲岫縣晴嶺市雲端大道 511 號', 30, 200, 'CLOSED', 'LEARNING', '2025-04-09 19:00:00', '2025-04-08 19:00:00', FALSE, '2025-03-24 19:00:00', '2025-03-24 19:00:00'),
(10, 2, '週末沒事來跳舞？', '音樂很大聲，但來了應該會很開心，穿輕鬆一點不要尷尬～', '長樂縣安寧市和風街 33 巷 2 弄 10 號', 70, 200, 'CLOSED', 'PARTY', '2025-05-08 18:00:00', '2025-05-04 18:00:00', FALSE, '2025-04-12 18:00:00', '2025-04-12 18:00:00'),
(11, 10, '開發者社群小小揪', '沒有很專業，真的就只是想找人一起講幹話，討論技術也可以。', '星語縣夢境市星光一路 72 號', 30, 200, 'CLOSED', 'LEARNING', '2025-04-29 18:00:00', '2025-04-28 18:00:00', FALSE, '2025-04-14 18:00:00', '2025-04-14 18:00:00'),
(12, 2, '北海道泡湯團', '純粹想泡湯，有人要跟嗎？白天行程我應該會亂走一通。', '日本北海道', 40, 35000, 'OPEN', 'TRAVEL', '2026-07-11 05:00:00', '2026-03-16 23:59:59', FALSE, '2025-12-01 13:00:00', '2025-12-01 13:00:00'),
(13, 40, '達悟族之美', '參觀達悟族的鐵桶和丁字褲文化', '台東縣蘭嶼鄉', 300, 0, 'OPEN', 'PARTY', '2026-06-01 07:00:00', '2026-05-25 23:59:59', FALSE, '2025-12-03 10:34:28', '2025-12-03 10:34:28'),
(14, 40, '一起去安大林森公園哭', '一起分享今年的洗褲哀樂', '安大林森公園', 3000, 0, 'OPEN', 'PARTY', '2026-12-31 19:00:00', '2026-12-26 23:59:59', FALSE, '2025-12-03 10:40:13', '2025-12-03 10:40:13');
